bg/js/interface/mc/oceanTpl/MCRegistReq.html

<?xml version='1.0' encoding='utf-8'?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope">
    <soap:Body>
        <ns1:MCRegistReq xmlns:ns1="http://mobicom.oceanbank.ru/xsd"
                         xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" ns1:version="1.0"
                         ns1:hash="sACzmyYo0JdW5/HStqx07Q==">
            <ns1:Agregator>
                <ns1:id>165</ns1:id>
            </ns1:Agregator>
            <ns1:Merchant>
                <ns1:id>3853</ns1:id>
            </ns1:Merchant>
            <ns1:Owner>
                <ns1:id>3C548DBC575D44448c7E07Ec98f00fFC</ns1:id>
            </ns1:Owner>
            <ns1:Client>
                <ns1:Phone>
                    <ns1:number>9164819441</ns1:number>
                </ns1:Phone>
            </ns1:Client>
            <ns1:Payment>
                <ns1:amount>1000</ns1:amount>
                <ns1:abonentFee xsi:nil="1"/>
                    <ns1:currency>643</ns1:currency>
                    <ns1:result>70008</ns1:result>
                    <ns1:errorDesc>Сервис для Вас недоступен (Недостаточно средств для проведения операции).
                    </ns1:errorDesc>
            </ns1:Payment>
            <ns1:Transaction>
                <ns1:id>3EE966B2761D19026C55D7812D275349</ns1:id>
            </ns1:Transaction>
        </ns1:MCRegistReq>
    </soap:Body>
</soap:Envelope>